In [1]:
# Below is a snippet from a table that contains information about employees that work at Company XYZ:


# employee_name	employee_id	date_joined	age	yrs_of_experience
# Andy	123456	2015-02-15	45	24
# Beth	789456	2014-02-15	36	15
# Cindy	654123	2017-05-16	34	14
# Dale	963852	2018-01-15	25	4

# Company XYZ is looking to create a report that groups the years of experience of its 
# employees into 3 simple categories, with the following bins (inclusive):

# 0-5 Low
# 6-15 Medium
# 16+ High
# Additionally, you can assume the data is clean and there are no employees with 
# negative or non-numerical years of experience.

# Write code in Python (using Pandas) to create a new column in the dataframe, called 
#'experience_binned', that groups employees as requested above.

In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame({
    'employee_name':['Andy','Beth', 'Cindy', 'Dale'],
    'employee_id':[123456, 789456,654123, 963852],
    'date_joined':['2015-02-15', '2014-02-15', '2017-05-16', '2018-01-15'],
    'age':[45,36,34,25],
    'yrs_of_experience':[24,15,14,4]
})

In [13]:
df['experience_binned'] = pd.cut(df['yrs_of_experience'], bins=[0,5, 15,100], labels = ['lo'])

In [11]:
df

,employee_name,employee_id,date_joined,age,yrs_of_experience,experience_binned
0,Andy,123456,2015-02-15,45,24,"(15, 100]"
1,Beth,789456,2014-02-15,36,15,"(5, 15]"
2,Cindy,654123,2017-05-16,34,14,"(5, 15]"
3,Dale,963852,2018-01-15,25,4,"(0, 5]"